In [40]:
import pandas as pd

In [ ]:
ice_cream=["Chocolate","Vanilla","Strawberry","Rum Raisin"]
pd.Series(ice_cream)

In [ ]:
lottery=[4,6,24,54,34,34,12]
pd.Series(lottery)

In [ ]:
registration=[True, False, True]
pd.Series(registration)

In [ ]:
sushi={
    "Salmon":"Orange",
    "Tuna":"Red",
    "Eel":"White"
}
pd.Series(sushi)

In [ ]:
countries=["USA", "France", "Germany", "Italy"]
pd.Series(countries)

In [ ]:
colors=["red", "green", "blue"]
pd.Series(colors)

In [5]:
values=[1,2,3,4.5]
values.append(4.5)
pd.Series(values)

0    1.0
1    2.0
2    3.0
3    4.5
4    4.5
dtype: float64

In [11]:
prices=pd.Series([3.5, 54.5, 3.67])
# pd.Series(prices)

In [12]:
prices.sum()

61.67

In [13]:
prices.sum()

700.0525

In [7]:
import pandas as pd
#import numpy as np
home_runs=pd.Series([3,4,8,12])
total_home_runs=home_runs.sum()
print(total_home_runs)
average_home_run=home_runs.mean() # mean is a method
average_home_run
home_runs.count

27

<bound method Series.count of 0     3
1     4
2     8
3    12
dtype: int64>

In [10]:
fruits=["bananas", "apples", "orange", "plum", "grapes"]
weekdays=["monday",  "tuesday", "wednesday", "thursday", "friday"]
pd.Series(fruits, weekdays)

monday       bananas
tuesday       apples
wednesday     orange
thursday        plum
friday        grapes
dtype: object

In [20]:
# Creating a series with indax and data from two lists
foods=["French Fries", "Chicken Nuggets", "Celery", "Carrots"]
sauces=["BBQ", "Honey Mustard", "Ranch", "Sriracha"]
s1=pd.Series(foods, sauces)

s2=pd.Series(data=sauces, index=foods)
s2

French Fries                 BBQ
Chicken Nuggets    Honey Mustard
Celery                     Ranch
Carrots                 Sriracha
dtype: object

In [18]:
#Importing data/series into python using read_csv
age=pd.read_csv("insurance.csv", usecols=["age"]).squeeze() #exmple 1

In [23]:
pd.read_csv("insurance.csv", usecols=["bmi"]).squeeze()

0       27.900
1       33.770
2       33.000
3       22.705
4       28.880
         ...
1333    30.970
1334    31.920
1335    36.850
1336    25.800
1337    29.070
Name: bmi, Length: 1338, dtype: float64

In [32]:
pokemon=pd.read_csv("pokemon.csv", usecols=["name","weight_kg"])

          name  weight_kg
459  Abomasnow      135.5
62        Abra       19.5
358      Absol       47.0
616   Accelgor       25.3
680  Aegislash       53.0
..         ...        ...
570    Zoroark       81.1
569      Zorua       12.5
40       Zubat        7.5
633   Zweilous       50.0
717    Zygarde      284.6

[801 rows x 2 columns]

In [38]:
pokemon.tail(5)

           name  weight_kg
796  Celesteela      999.9
797     Kartana        0.1
798    Guzzlord      888.0
799    Necrozma      230.0
800    Magearna       80.5

In [42]:
insurance=pd.read_csv("insurance.csv")

In [44]:
insurance.product

<bound method DataFrame.prod of       age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]>